Урок 7 : Комментарии

Сегодня разговор пойдет о том как сделать комментарии на нашем блоге.
---

В этой статье мы рассмотрим с вами как добавить формочку комментариев к нам в блог, и безопасно обрабатывать входные данные. Простой план сегодняшнего занятия выглядит следующим образом:

    Создаем форму (отображение) для добавления комментария
    Подключаем форму на страницу
    Подключаем вывод всех комментариев по посту внизу страницы
    Работа с контроллером. Добавляем поиск всех комментариев
    Работа с контроллером. Механизм проверки что пришли данные с формы
    Создаем модель Comments
    Пробуем

В принципе ничего замысловатого. Ну что, начнем?

Введение

Форма добавления комментариев будет выглядеть примерно точно также как у меня на dbhelp.ru. Как вы понимаете комментарии у нас смогут оставлять как зарегистрированные так и не зарегистрированные пользователи.

Создаем форму для добавления комментария

Открываем protected/views/post/ и создаем там файл _commentsForm.php:

<h1 id="respond">

<?php echo CHtml::form(); ?>
<?php echo CHtml::errorSummary($form); ?>

    <?php echo CHtml::activeTextArea($form, 'text', array('cols' => 50, 'rows' => 8)) ?>
    <table border=0 id="captcha">
    <tr>
        <td valign="top"><?php $this->widget('CCaptcha', array('buttonLabel' => '')); ?>
        <td valign="top">
            <table border=0>
            <tr>
                <td valign="top"><?php echo CHtml::activeLabel($form, 'verifyCode'); ?></td>
                <td valign="top"><?php echo CHtml::activeTextField($form,'verifyCode'); ?></td>
            </tr>
            <tr id="login">
                <td valign="top"><?php echo CHtml::activeLabel($form, 'login'); ?></td>
                <td valign="top"><?php echo CHtml::activeTextField($form, 'login') ?></td>
            </tr>
            </table>
        </td> 
    </tr>
    </table>
    
    <p><?php echo CHtml::submitButton("Ок, отправить!", array('id' => "submit")); ?></p>

<?php echo CHtml::endForm($form); ?>

Тут же внизу я добавляю немного javascript (jQuery) кода для красоты, который чуть ниже мы рассмотрим подробнее:


<script>
    $(document).ready(function() {
        $("#captcha").hide();
        $("#guestlogin").hide();
            
                $("#Comments_text").click(function(){
                    <?php if (Yii::app()->user->isGuest): ?>    
                        $("#guestlogin").show();
                    <?php endif; ?>
                        $("#captcha").show();
                });
    });


Данный код отображает поля "капча" и "имя" при клике на поле ввода текста.
Также хочу заметить что поле "имя" выводиться только если пользователь гость. (для этого в коде поставлена соответствующая проверка).
.
Как вы видите код написан с использованием jQuery, поэтому его необходимо предварительно подключить на сайт. Я не агитирую использовать именно jQ для таких вещей, просто привёл пример того как это делаю я. Интересная вещь, мой Yii сам увидел что страница использует jQuery код и сам подключил его! Так что в ручную вам добавлять какой либо код подключения библиотеки не придется, всё делает фреймворк.

Если всё же jQuery у вас автоматически не подключился используйте следующие строчки:
 =Yii::app()->clientScript;
 ->registerCoreScript( );

добавить их надо в PostController -> actionView()


Подключаем вывод всех комментариев по посту внизу страницы

Я надеюсь вы не забыли что кроме формы добавления комментариев, нам надо бы еще вывести все комментарии для темы. (т.е. которые написали уже до вас)
Так как мы начали уже работать с отображением, давайте не будем далеко ходить и организуем файл вывода (предполагая что список всех комментариев у нас находиться в переменной $comments).

Т.е. что я предлагаю сделать: сейчас создадим файл отображения который будет выводить нам список всех комментариев которые уже есть. Как вы понимаете с контроллера к нам еще не какие данные не приходят в отображение (мы еще не дошли до работы с контроллером), поэтому мы должны представить что переменная $comments уже содержит в себе список нужных нам комментариев.

Это способ разработки от конца к началу. Мы сначала создаем файл который будет обрабатывать данные которые должны прийти (отображение), а потом создаем файл который эти данные будет передавать (экшинс контроллера).

Откройте файл protected/views/post/view.php. Именно этот файл отвечает за вывод страницы по конкретному посту. В него нам надо добавить вывод списка всех комментариев и вывод формы добавления. Я это сделал следующим образом:


<table border=  width= >

        (! ( )) :  
        <tr><td><h1><?= ->name; </h1></td></tr>
        <tr><td><?= ->created; </td></tr>
        <tr><td><?= ->text; </td></tr>
        <tr>
            <td>
                <h3>Комментарии</h3>
                <table border=  width=  cellpadding=  cellspacing= >
                     
                        (! ( ))
                          (      =>  ) {
                             ->renderPartial( , (
                                 => ,
                            )); 
                        }
                     
                </table>
                
                <div align= >
                         ->renderPartial( ,  (  =>  )); 
                </div>
                
            </td>
        </tr>
       ;  

</table>


У нас добавилось еще одно поле в таблицу - комментарии. После него в цикле мы каждый комментарий загружаем через отображением _comments (в которое мы передаем данные текущего комментария). Данный подход я уже использовал вот в этом уроке.

Чуть ниже я подключил файл _commentsForm который мы с вами создали чуть выше. Я надеюсь с этим всё понятно.
По поводу переменных $comments и $comm_form - вы всё поймете когда мы будем работать с контроллером. (хотя я надеюсь вы уже сейчас понимаете для чего они примерно надо и что в себе должны содержать).

Давайте перейдем к созданию файла protected/views/post/_comments.php:

<tr>
    <td>
        <table border=  width= >
            <tr><td>     ->login;  </td></tr>
            <tr><td>    nl2br(htmlentities( ->text,  ,  ));  </td></tr>
        </table>
    </td>
</tr>


Работа с контроллером. Добавляем поиск всех комментариев

Теперь было бы отлично зайти в наш контроллер PostController и немного подредактировать метод actionView():


            actionView ()
        {
             ->pageTitle =  ;

              (! ( [ ])) {
                 
                 
                  = substr(trim( [ ]),  ,  );
                
                 
                 (preg_match( ,  )) {
                     = Posts::model()->find( ,  (  =>  ));
                   
                     
                      (! ( )) {
                        
                         
                          =   Comments();
                        
                         
                                       =   CDbCriteria;
                         
                         ->condition =  ;
                         
                         ->params     =  (  =>  ->id);
                         
                         ->order     =  ;
                         
                          =  ->findAll( );
                        
                         ->render( ,  (
                                      =>  ,
                             
                                 =>  ,
                              =>  ,
                        ));
                        
                    }   {
                         
                        Yii::app()->runController( );
                    }
                }   {
                    Yii::app()->runController( );
                }
            }   {
                 
                Yii::app()->runController( );
            }
        }


Мы делаем простую выборку комментариев текущего поста.

Работа с контроллером. Механизм проверки что пришли данные с формы

Теперь давайте проверим пришли ли данные с формы и выполним валидацию. Поэтому в метод actionView() добавляем еще немного кода, и теперь он выглядит вот так:


            actionView ()
        {
             ->pageTitle =  ;

              (! ( [ ])) {
                 
                 
                  = substr(trim( [ ]),  ,  );
                
                 
                 (preg_match( ,  )) {
                     = Posts::model()->find( ,  (  =>  ));
                   
                     
                      (! ( )) {
                        
                         
                          =   Comments();
                        
                         
                          (! ( [ ]))
                        {
                             ->attributes =  [ ];
                             ->id_post       = (int) ->id;
                             ->created    = date( );
                            
                                  (!Yii::app()->user->isGuest) {
                                     
                                     
                                     ->id_user = Yii::app()->user->id;
                                     ->login     = Yii::app()->user->name;
                                }   {
                                     
                                     ->id_user =  ;
                                }
                            
                             
                             
                             
                              ( ->validate( )) {
                                 
                                 ->save();
                            }   {
                                 
                                 
                            }
                        }
                        
                         
                                       =   CDbCriteria;
                         
                         ->condition =  ;
                         
                         ->params     =  (  =>  ->id);
                         
                         ->order     =  ;
                         
                          =  ->findAll( );
                        
                         ->render( ,  (
                                      =>  ,
                             
                                 =>  ,
                              =>  ,
                        ));
                        
                    }   {
                         
                        Yii::app()->runController( );
                    }
                }   {
                    Yii::app()->runController( );
                }
            }   {
                 
                Yii::app()->runController( );
            }
        }

Я надеюсь комментариев в коде вам достаточно что бы понять суть работы. 


Создаем модель Comments

Теперь мы перешли к одному из главных моментов - создание модели.
Создаем файл Comments в папке models:


 
  Comments   CActiveRecord
{        
       ;
        =  ;
    
          model( =__CLASS__)
    {
           ::model( );
    }
        tableName()
    {
           ;
    }
        relations()
    {
           (
             
             
              =>  ( ::BELONGS_TO,  ,  ),
        );
    }
}


Тут вы должны были увидеть такую вещь с которой мы раньше НЕ работали. В relations задаются связи нашей модели с другими моделями. Для лучшего понимания скажу что это некий JOIN который будет выполняться автоматически когда мы делаем select.

В данном случае я связываю комментарий к моделью User по полю id_user. Мне это нужно при выводе комментариев (что бы знать текущий логин пользователя который оставил комментарий вместо его id . Подробнее прочитать про relations вы может в статье Реляционная Active Record [рус.]

Теперь нам надо бы добавить safeAttributes (для защиты от хаЦкеров) и attributeLabels (для красоты отображения имен полей). Добавляем в Comments.php :


            attributeLabels()
    {
           (
              =>  ,
                   =>  ,
        );
    }    
        safeAttributes()
    {
           ( ,  ,  );
    }


Ну а теперь пожалуй самое важное - rules. Правил для проверки данных у нас будет в принципе немного, но без них форма была бы очень не безопасна:


        rules()
    {
           (
             
             ( ,  ,   => ,  =>  ),
             
             ( ,  ,  => ,   =>  ),
             
             ( ,  ,  =>!extension_loaded( )),
        );
    }


Хочу заметить что логин я проверяю по той причине что гость у нас в форме может написать всё что угодно.

Для удобства файл Comments.php в конечном итоге у вас должен выглядеть следующим образом:


 
  Comments   CActiveRecord
{        
       ;
        =  ;
    
          model( =__CLASS__)
    {
           ::model( );
    }
        tableName()
    {
           ;
    }
        relations()
    {
           (
             
             
              =>  ( ::BELONGS_TO,  ,  ),
        );
    }
        attributeLabels()
    {
           (
              =>  ,
                   =>  ,
        );
    }    
        safeAttributes()
    {
           ( ,  ,  );
    }
        rules()
    {
           (
             
             ( ,  ,   => ,  =>  ),
             
             ( ,  ,  => ,   =>  ),
             
             ( ,  ,  =>!extension_loaded( )),
        );
    }
}


Пробуем

Теперь смело заходим к себе на localhost на страницу одной из тем, и проверяем как работаю комментарии.
Как это работает у меня - вы можете посмотреть на yii.dbhelp.ru

Вот и все. Надеюсь у вас получилось со всем разобраться.

Кстати хочу посоветовать вам одну отличную методику которой часто пользуюсь для усвоения материала. Первый раз прочитайте статью и выполняйте все действий. Когда поймете что вы в принципе поняли как это дело работает - просто удалите всё. Закройте блог, и попробуйте всё повторить самостоятельно. Если с первого раза не получиться - подсмотрите в блог, и попробуйте продолжить дальше самостоятельно.

 


Исходники
_comments.php
_commentsForm.php
Comments.php
PostController.php
view.php
структура проекта + исходники урока (rar)


